ymaps.ready(init);

function init() {
    var myMap = new ymaps.Map("map", {
            center: [55.75222, 37.61556],
            zoom: 12
        }, {
            searchControlProvider: 'yandex#search'
        });

    // Создаем многоугольник, используя класс GeoObject.
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                [
                    [55.72981671, 37.61238098],
                    [55.72981671, 37.62594223],
                    [55.73116995, 37.63830185],
                    [55.74267062, 37.65478134],
                    [55.75262224, 37.65615463],
                    [55.76015673, 37.65787125],
                    [55.76402001, 37.65649796],
                    [55.768752, 37.64911652],
                    [55.77232476, 37.63744354],
                    [55.77271099, 37.6322937],
                    [55.77357998, 37.62817383],
                    [55.77357998, 37.6171875],
                    [55.77300065, 37.60482788],
                    [55.76981421, 37.59607315],
                    [55.76421316, 37.58852005],
                    [55.75909427, 37.5847435],
                    [55.75242903, 37.58268356],
                    [55.74634239, 37.58268356],
                    [55.73851531, 37.58628845],
                    [55.72981671, 37.61238098]
                ],

            ],

        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContent: "Зона Живой Парковки"
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#65afb8',
        // Цвет обводки.
        strokeColor: '#2d2da8',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.5,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'solid'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);

    myMap.behaviors
    // Отключаем некоторые включенные по умолчанию поведения:
    //  - drag - перемещение карты при нажатой левой кнопки мыши;
    //  - rightMouseButtonMagnifier - увеличение области, выделенной
    //    правой кнопкой мыши.
    .disable(['drag', 'scrollZoom'])
}